core/app/Http/Controllers/SiteController.php

select * from `pages` where `name` = 'home' limit 1
select * from `plans` where `status` = 1
---
    public function index()
    {

        $pageTitle = 'Home';

        $sections = Page::where('name', 'home')->first();

        if (!$sections) {

            $sections = Page::create([
                'name' => 'home',
                'sections' => ['about'],
                'slug' => 'home',
                'seo_description' => 'home',
                'page_order' => 1
            ]);
        }

        $plan = Plan::where('status', 1)->get();

select * from `plans` where `status` = 1
---
    public function investmentPlan()
    {
        $pageTitle = "Investment Plan";
        $plans = Plan::where('status', 1)->get();

select * from `general_settings` limit 1
select * from `plans` where `plans`.`id` = '10' limit 1
select * from `times` where `times`.`id` in (5)
---
    public function investmentUsingBalannce(Request $request)
    {

        $request->validate([
            'amount' => 'required|numeric'
        ]);

        $general = GeneralSetting::first();

        $plan_id = Plan::with('time')->findOrFail($request->plan_id);

update `users` set `balance` = 15, `users`.`updated_at` = '2023-04-10 08:23:57' where `id` = 1
insert into `payments` (`plan_id`, `gateway_id`, `user_id`, `transaction_id`, `amount`, `rate`, `charge`, `final_amount`, `payment_status`, `next_payment_date`, `updated_at`, `created_at`) values (10, 0, 1, 'JYUVVQAY2SWMSA4T', '5', 0, 0, '5', 1, '2023-04-11 08:23:57', '2023-04-10 08:23:57', '2023-04-10 08:23:57')
---
        }

        $user->balance = $user->balance - $request->amount;
        $user->save();

        $deposit = Payment::create([
            'plan_id' => $plan_id->id,
            'gateway_id' => 0,
            'user_id' => auth()->id(),
            'transaction_id' => $trx,
            'amount' => $request->amount,
            'rate' => 0,
            'charge' => 0,
            'final_amount' => $request->amount,
            'payment_status' => 1,
            'next_payment_date' => $next_payment_date,

        ]);

insert into `transactions` (`trx`, `gateway_id`, `amount`, `currency`, `details`, `charge`, `type`, `gateway_transaction`, `user_id`, `payment_status`, `updated_at`, `created_at`) values ('JYUVVQAY2SWMSA4T', 0, '5', 'USD', 'Payment Successfull', 0, '-', '', 1, 1, '2023-04-10 08:23:57', '2023-04-10 08:23:57')
---



        Transaction::create([
            'trx' => $deposit->transaction_id,
            'gateway_id' => $deposit->gateway_id,
            'amount' => $deposit->final_amount,
            'currency' => @$general->site_currency,
            'details' => 'Payment Successfull',
            'charge' => 0,
            'type' => '-',
            'gateway_transaction' => '',
            'user_id' => auth()->id(),
            'payment_status' => 1,
        ]);