core/app/Http/Controllers/UserController.php

    public function dashboard()
    {


        $pageTitle = "Dashboard";
        $totalInvest = Payment::where('user_id', Auth::id())->where('payment_status', 1)->sum('amount');
        $currentInvest = Payment::where('user_id', Auth::id())->where('payment_status', 1)->latest()->first('amount');
        $currentPlan = Payment::with('plan')->where('user_id', Auth::id())->where('payment_status', 1)->latest()->first();
        $allPlan = Payment::with('plan')->where('user_id', Auth::id())->latest()->paginate(10, ['*'], 'plan');
        $withdraw = Withdraw::where('user_id', Auth::id())->where('status', 1)->sum('withdraw_amount');
        $interestLogs = UserInterest::with('payment')->where('user_id', Auth::id())->latest()->paginate(10, ['*'], 'log');

        $commison = RefferedCommission::where('reffered_by', Auth::id())->sum('amount');

        $pendingInvest = Payment::where('user_id', Auth::id())->where('payment_status', 2)->sum('amount');
        $pendingWithdraw = Withdraw::where('user_id', Auth::id())->where('status', 0)->sum('withdraw_amount');
        $totalDeposit = Deposit::where('user_id', Auth::id())->where('payment_status', 1)->sum('final_amount');
---
select sum(`amount`) as aggregate from `payments` where `user_id` = 1 and `payment_status` = 1
select `amount` from `payments` where `user_id` = 1 and `payment_status` = 1 order by `created_at` desc limit 1
select * from `payments` where `user_id` = 1 and `payment_status` = 1 order by `created_at` desc limit 1
select * from `plans` where `plans`.`id` in (10)
select * from `payments` where `user_id` = 1 order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `payments` where `user_id` = 1
select sum(`withdraw_amount`) as aggregate from `withdraws` where `user_id` = 1 and `status` = 1
select * from `payments` where `payments`.`id` in (3)
select * from `user_interests` where `user_id` = 1 order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `user_interests` where `user_id` = 1
select sum(`amount`) as aggregate from `reffered_commissions` where `reffered_by` = 1
select sum(`amount`) as aggregate from `payments` where `user_id` = 1 and `payment_status` = 2
select sum(`withdraw_amount`) as aggregate from `withdraws` where `user_id` = 1 and `status` = 0
select sum(`final_amount`) as aggregate from `deposits` where `user_id` = 1 and `payment_status` = 1

    public function withdraw()
    {
        $pageTitle = 'Withdraw Money';

        $withdraws = WithdrawGateway::where('status', 1)->latest()->get();
---
select * from `withdraw_gateways` where `status` = 1 order by `created_at` desc

    public function withdrawFetch(Request $request)
    {
        $withdraw = WithdrawGateway::findOrFail($request->id);
---
select * from `withdraw_gateways` where `withdraw_gateways`.`id` = '1' limit 1

    public function returnInterest()
    {
        $general = GeneralSetting::first();
        $invests = Payment::with('plan', 'user')->where('payment_status', 1)->latest()->get();
---
select * from `general_settings` limit 1
select * from `payments` where `payment_status` = 1 order by `created_at` desc
select * from `plans` where `plans`.`id` in (10)
select * from `users` where `users`.`id` in (1)

                        //paymentupdate on next date
                        $updatePayment = Payment::where('plan_id', $invest->plan_id)->where('next_payment_date', $invest->next_payment_date)->first();

                        $count = Payment::where('plan_id', $invest->plan_id)->where('next_payment_date', $invest->next_payment_date)->sum('pay_count');
---
select sum(`pay_count`) as aggregate from `payments` where `plan_id` = 10 and `next_payment_date` = '2023-04-10 08:28:22'
select * from `payments` where `plan_id` = 10 and `next_payment_date` = '2023-04-10 08:28:22' limit 1

                                $updatePayment->interest_amount += $interestAmount;
                                $updatePayment->pay_count += 1;

                                UserInterest::create([
                                    'user_id' => $user->id,
                                    'payment_id' => $invest->id,
                                    'interest_amount' => $interestAmount,
                                    'purpouse' => 'Invest Return Commission'
                                ]);
---
insert into `user_interests` (`user_id`, `payment_id`, `interest_amount`, `purpouse`, `updated_at`, `created_at`) values (1, 4, '5.00000000', 'Invest Return Commission', '2023-04-10 08:28:44', '2023-04-10 08:28:44')

                                    'currency' => @$general->site_currency
                                ], $invest->user);

                                $updatePayment->save();
                                $user->save();
---
update `payments` set `next_payment_date` = '2023-04-11 08:28:22', `interest_amount` = 5, `pay_count` = 1, `payments`.`updated_at` = '2023-04-10 08:28:46' where `id` = 4
update `users` set `balance` = 20, `users`.`updated_at` = '2023-04-10 08:28:46' where `id` = 1


                                if ($updatePayment->pay_count == $invest->plan->how_many_time) {
                                    $updatePayment->next_payment_date = null;
                                    $updatePayment->save();
---
update `payments` set `next_payment_date` = '', `payments`.`updated_at` = '2023-04-10 08:28:46' where `id` = 4

                                        $updatePayment->next_payment_date = null;
                                        $updatePayment->pay_count = null;
                                        $updatePayment->save();
                                        $user->save();

                                        Transaction::create([
                                            'trx' => strtoupper(Str::random(16)),
                                            'gateway_id' => 0,
                                            'amount' => $invest->amount,
                                            'currency' => @$general->site_currency,
                                            'details' => 'Capital Back For Plan '. $invest->plan->plan_name,
                                            'charge' => 0,
                                            'type' => '+',
                                            'gateway_transaction' => '',
                                            'user_id' => $user->id,
                                            'payment_status' => 1
                                        ]);
---
update `users` set `balance` = 25, `users`.`updated_at` = '2023-04-10 08:28:46' where `id` = 1
insert into `transactions` (`trx`, `gateway_id`, `amount`, `currency`, `details`, `charge`, `type`, `gateway_transaction`, `user_id`, `payment_status`, `updated_at`, `created_at`) values ('a4JWr0G5P6hHnJIB', 0, '5.00000000', 'USD', 'Capital Back For Plan test', 0, '+', '', 1, 1, '2023-04-10 08:28:46', '2023-04-10 08:28:46')

    public function interestLog(Request $request)
    {

        $data['interestLogs'] = UserInterest::when($request->date, function ($item) use ($request) {
            $item->whereDate('created_at', $request->date);
        })->with('payment')->where('user_id', Auth::id())->latest()->get();
---
select * from `payments` where `payments`.`id` in (1)
select * from `user_interests` where `user_id` = 1 order by `created_at` desc

    public function transactionLog(Request $request)
    {
        $pageTitle = 'Transaction Log';

        $transactions = Transaction::when($request->trx, function ($item) use ($request) {
            $item->where('trx', $request->trx);
        })->when($request->date, function ($item) use ($request) {
            $item->whereDate('created_at', $request->date);
        })->where('user_id', auth()->id())->where('payment_status', 1)->latest()->paginate();
---
select * from `transactions` where `user_id` = 1 and `payment_status` = 1 order by `created_at` desc limit 15 offset 0
select count(*) as aggregate from `transactions` where `user_id` = 1 and `payment_status` = 1

    public function planRemove(Request $request, $id)
    {
        $user = User::find($id);


        $payment = Payment::where('user_id', $user->id)->where('plan_id', $request->plan)->first();


        $user->balance = $user->balance + $payment->amount;

        $user->save();


        $payment->delete();
---
select * from `users` where `users`.`id` = '1' limit 1
select * from `payments` where `user_id` = 1 and `plan_id` = '10' limit 1
update `users` set `balance` = 15, `users`.`updated_at` = '2023-04-10 08:18:57' where `id` = 1
delete from `payments` where `id` = 1