core/app/Http/Controllers/Admin/ManageUserController.php

    public function index()
    {

        $data['pageTitle'] = 'All Users';
        $data['navManageUserActiveClass'] = 'active';
        $data['subNavManageUserActiveClass'] = 'active';

        $data['users'] = User::latest()->paginate();
---
select count(*) as aggregate from `users`